"Please Donate" = "Molimo te, da doniraš";
"Donate" = "Doniraj";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Ovo je besplatan softver, međutim pisanje programa, održavanje podrške i izrada distribucija svejedno košta. Ako ga voliš koristiti, doniraj autoru ovog softvera. To će pomoći, da Cyberduck bude još bolji!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Kao donator Cyberducku primit ćeš registracijski ključ koji deaktivira ovu poruku.";
"Thank you for using Cyberduck!" = "Hvala, što koristiš Cyberduck!";
"Later" = "Kasnije";
"Don't show again for this version" = "Za ovu verziju više nemoj prikazati";
"Registration Key" = "Registracijski ključ";

"Buy in Windows Store" = "Kupi u Windows Store";
"Buy in Mac App Store" = "Kupi u Mac App Store";
